**Intro to Pandas**

In [0]:
import pandas as pd 
import numpy as np

In [0]:
list1=[10,20,30]
labels=["a","b","c"]

* Pandas Series

In [61]:
pd.Series(data=list1,index=labels)

a    10
b    20
c    30
dtype: int64

In [0]:
a=pd.Series(data=list1,index=labels)

In [63]:
print(a[0])
print(a['a'])

10
10

In [64]:
type(a)

pandas.core.series.Series

In [0]:
list2=[10,30,50]
labels2=["a","b","d"]
b=pd.Series(data=list2,index=labels2)

In [66]:
b

a    10
b    30
d    50
dtype: int64

In [67]:
a+b

a    20.0
b    50.0
c     NaN
d     NaN
dtype: float64

* Pandas Dataframe 
  (Multiple data Series)
* used to read csv file 
* used to create dataset

In [0]:
columns=['W','X','Y','Z']
index=["A","B","C","D","E"]

In [0]:
from numpy.random import randint 
np.random.seed(42)

data=randint(-100,100,(5,4))

In [70]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [71]:
df= pd.DataFrame(data=data,columns=columns,index=index)
print(df)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

* Reading column-wise data
* df[list of column name ] (list required)

In [72]:
type(df[['W','X']])

pandas.core.frame.DataFrame

* create new column in existing dataFrame

In [0]:
df['new'] = df['W']+ df['Y']

In [74]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

* remove a column 
* using df.drop(list of column names,axis=1)

In [75]:
df.drop(['new','X'],axis=1)

    W   Y   Z
A   2  -8 -86
B   6  88 -80
C   2 -26 -13
D  16   3  51
E  30 -48 -99

In [76]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [0]:
df =df.drop(['new','X'],axis=1)

In [78]:
df

    W   Y   Z
A   2  -8 -86
B   6  88 -80
C   2 -26 -13
D  16   3  51
E  30 -48 -99

Dealing with Row
*  df.loc[list of rows]
* df.iloc[row no.]

In [79]:
df.loc[['A','B']]

   W   Y   Z
A  2  -8 -86
B  6  88 -80

In [80]:
df.iloc[0:3]

   W   Y   Z
A  2  -8 -86
B  6  88 -80
C  2 -26 -13

In [81]:
df.iloc[:3,:3]

   W   Y   Z
A  2  -8 -86
B  6  88 -80
C  2 -26 -13

* remove row-wise

In [82]:
df.drop(["A","B"],axis=0)

    W   Y   Z
C   2 -26 -13
D  16   3  51
E  30 -48 -99

* Select a subset of row and column 
* df.loc[[list of rows],[list of columns]]

In [83]:
df.loc[['A','B'],["W","Y"]]

   W   Y
A  2  -8
B  6  88

* more on DataFrame

In [84]:
df

    W   Y   Z
A   2  -8 -86
B   6  88 -80
C   2 -26 -13
D  16   3  51
E  30 -48 -99

* conditional dataframe 
* df[condition]

In [85]:
df>0

      W      Y      Z
A  True  False  False
B  True   True  False
C  True  False  False
D  True   True   True
E  True  False  False

In [86]:
df[df>0]

    W     Y     Z
A   2   NaN   NaN
B   6  88.0   NaN
C   2   NaN   NaN
D  16   3.0  51.0
E  30   NaN   NaN

In [87]:
df['W']>0

A    True
B    True
C    True
D    True
E    True
Name: W, dtype: bool

In [88]:
df[df['W']>0]#['W']

    W   Y   Z
A   2  -8 -86
B   6  88 -80
C   2 -26 -13
D  16   3  51
E  30 -48 -99

In [89]:
df[  ( df['W']> 0 )  &   ( df['Y'] >1  )   ]

    W   Y   Z
B   6  88 -80
D  16   3  51

* index Manipulation

In [90]:
df.reset_index()

  index   W   Y   Z
0     A   2  -8 -86
1     B   6  88 -80
2     C   2 -26 -13
3     D  16   3  51
4     E  30 -48 -99

In [0]:
new_ind=[1,2,3,4,5]
df['new_index']=new_ind

In [92]:
df

    W   Y   Z  new_index
A   2  -8 -86          1
B   6  88 -80          2
C   2 -26 -13          3
D  16   3  51          4
E  30 -48 -99          5

In [93]:
df.set_index('new_index')

            W   Y   Z
new_index
1           2  -8 -86
2           6  88 -80
3           2 -26 -13
4          16   3  51
5          30 -48 -99

In [94]:
df.describe()

              W          Y          Z  new_index
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000   1.800000 -45.400000   3.000000
std    11.96662  51.915316  63.366395   1.581139
min     2.00000 -48.000000 -99.000000   1.000000
25%     2.00000 -26.000000 -86.000000   2.000000
50%     6.00000  -8.000000 -80.000000   3.000000
75%    16.00000   3.000000 -13.000000   4.000000
max    30.00000  88.000000  51.000000   5.000000

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   W          5 non-null      int64
 1   Y          5 non-null      int64
 2   Z          5 non-null      int64
 3   new_index  5 non-null      int64
dtypes: int64(4)
memory usage: 360.0+ bytes

In [96]:
df.dtypes

W            int64
Y            int64
Z            int64
new_index    int64
dtype: object

**Handling Missing data** (Nan)

*  leave it as missing
*  Remove missing data 
*  Fill missing data by method[link text](https://)

In [0]:
df= pd.DataFrame(data=[[1,2,np.nan,4],[5,np.nan,np.nan,8],[10,20,30,50]],columns=['A','B','C','D'])

In [98]:
df

    A     B     C   D
0   1   2.0   NaN   4
1   5   NaN   NaN   8
2  10  20.0  30.0  50

In [99]:
df.dropna()

    A     B     C   D
2  10  20.0  30.0  50

In [100]:
df.dropna(axis=1,thresh=2)

    A     B   D
0   1   2.0   4
1   5   NaN   8
2  10  20.0  50

In [101]:
df

    A     B     C   D
0   1   2.0   NaN   4
1   5   NaN   NaN   8
2  10  20.0  30.0  50

In [102]:
df.fillna(value=5.5)

    A     B     C   D
0   1   2.0   5.5   4
1   5   5.5   5.5   8
2  10  20.0  30.0  50

In [103]:
df['C'].fillna(value=0)

0     0.0
1     0.0
2    30.0
Name: C, dtype: float64

In [104]:
df

    A     B     C   D
0   1   2.0   NaN   4
1   5   NaN   NaN   8
2  10  20.0  30.0  50

In [0]:
df['B']=df['B'].fillna(value=df['B'].median())

In [106]:
df

    A     B     C   D
0   1   2.0   NaN   4
1   5  11.0   NaN   8
2  10  20.0  30.0  50

**Groupby**
* df.groupby(column_name).aggregate_function()

In [107]:
df=pd.read_csv("Salaries.csv")

FileNotFoundError: ignored

In [0]:
df

In [0]:
df.head()

In [0]:
df.groupby('sex').sum()

In [0]:
df.groupby('discipline').count().sort_index(ascending=True)

In [0]:
df.groupby(['rank','discipline']).sum()

In [0]:
df.groupby(['rank','discipline']).describe()

In [0]:
df.groupby(['rank','discipline']).describe().transpose()